MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2064DAA288/mcu.h
extern volatile __GLCDCURDATA36bits_t GLCDCURDATA36bits __asm__ ("GLCDCURDATA36") __attribute__((section("sfrs"), address(0xBF8EA890)));
#define GLCDCURDATA37 GLCDCURDATA37
extern volatile uint32_t   GLCDCURDATA37 __attribute__((section("sfrs"), address(0xBF8EA894)));
typedef struct {
  uint32_t PIXEL915:4;
  uint32_t PIXEL914:4;
  uint32_t PIXEL913:4;
  uint32_t PIXEL912:4;
  uint32_t PIXEL911:4;
  uint32_t PIXEL910:4;
  uint32_t PIXEL99:4;
  uint32_t PIXEL98:4;
} __GLCDCURDATA37bits_t;
extern volatile __GLCDCURDATA37bits_t GLCDCURDATA37bits __asm__ ("GLCDCURDATA37") __attribute__((section("sfrs"), address(0xBF8EA894)));
#define GLCDCURDATA38 GLCDCURDATA38
extern volatile uint32_t   GLCDCURDATA38 __attribute__((section("sfrs"), address(0xBF8EA898)));
typedef struct {
  uint32_t PIXEL923:4;
  uint32_t PIXEL922:4;
  uint32_t PIXEL921:4;
  uint32_t PIXEL920:4;
  uint32_t PIXEL919:4;
  uint32_t PIXEL918:4;
  uint32_t PIXEL917:4;
  uint32_t PIXEL916:4;
} __GLCDCURDATA38bits_t;
extern volatile __GLCDCURDATA38bits_t GLCDCURDATA38bits __asm__ ("GLCDCURDATA38") __attribute__((section("sfrs"), address(0xBF8EA898)));
#define GLCDCURDATA39 GLCDCURDATA39
extern volatile uint32_t   GLCDCURDATA39 __attribute__((section("sfrs"), address(0xBF8EA89C)));
typedef struct {
  uint32_t PIXEL931:4;
  uint32_t PIXEL930:4;
  uint32_t PIXEL929:4;
  uint32_t PIXEL928:4;
  uint32_t PIXEL927:4;
  uint32_t PIXEL926:4;
  uint32_t PIXEL925:4;
  uint32_t PIXEL924:4;
} __GLCDCURDATA39bits_t;
extern volatile __GLCDCURDATA39bits_t GLCDCURDATA39bits __asm__ ("GLCDCURDATA39") __attribute__((section("sfrs"), address(0xBF8EA89C)));
#define GLCDCURDATA40 GLCDCURDATA40
extern volatile uint32_t   GLCDCURDATA40 __attribute__((section("sfrs"), address(0xBF8EA8A0)));
typedef struct {
  uint32_t PIXEL107:4;
  uint32_t PIXEL106:4;
  uint32_t PIXEL105:4;
  uint32_t PIXEL104:4;
  uint32_t PIXEL103:4;
  uint32_t PIXEL102:4;
  uint32_t PIXEL101:4;
  uint32_t PIXEL100:4;
} __GLCDCURDATA40bits_t;
extern volatile __GLCDCURDATA40bits_t GLCDCURDATA40bits __asm__ ("GLCDCURDATA40") __attribute__((section("sfrs"), address(0xBF8EA8A0)));
#define GLCDCURDATA41 GLCDCURDATA41
extern volatile uint32_t   GLCDCURDATA41 __attribute__((section("sfrs"), address(0xBF8EA8A4)));
typedef struct {
  uint32_t PIXEL1015:4;
  uint32_t PIXEL1014:4;
  uint32_t PIXEL1013:4;
  uint32_t PIXEL1012:4;
  uint32_t PIXEL1011:4;
  uint32_t PIXEL1010:4;
  uint32_t PIXEL109:4;
  uint32_t PIXEL108:4;
} __GLCDCURDATA41bits_t;
extern volatile __GLCDCURDATA41bits_t GLCDCURDATA41bits __asm__ ("GLCDCURDATA41") __attribute__((section("sfrs"), address(0xBF8EA8A4)));
#define GLCDCURDATA42 GLCDCURDATA42
extern volatile uint32_t   GLCDCURDATA42 __attribute__((section("sfrs"), address(0xBF8EA8A8)));
typedef struct {
  uint32_t PIXEL1023:4;
  uint32_t PIXEL1022:4;
  uint32_t PIXEL1021:4;
  uint32_t PIXEL1020:4;
  uint32_t PIXEL1019:4;
  uint32_t PIXEL1018:4;
  uint32_t PIXEL1017:4;
  uint32_t PIXEL1016:4;
} __GLCDCURDATA42bits_t;
extern volatile __GLCDCURDATA42bits_t GLCDCURDATA42bits __asm__ ("GLCDCURDATA42") __attribute__((section("sfrs"), address(0xBF8EA8A8)));
#define GLCDCURDATA43 GLCDCURDATA43
extern volatile uint32_t   GLCDCURDATA43 __attribute__((section("sfrs"), address(0xBF8EA8AC)));
typedef struct {
  uint32_t PIXEL1031:4;
  uint32_t PIXEL1030:4;
  uint32_t PIXEL1029:4;
  uint32_t PIXEL1028:4;
  uint32_t PIXEL1027:4;
  uint32_t PIXEL1026:4;
  uint32_t PIXEL1025:4;
  uint32_t PIXEL1024:4;
} __GLCDCURDATA43bits_t;
extern volatile __GLCDCURDATA43bits_t GLCDCURDATA43bits __asm__ ("GLCDCURDATA43") __attribute__((section("sfrs"), address(0xBF8EA8AC)));
#define GLCDCURDATA44 GLCDCURDATA44
extern volatile uint32_t   GLCDCURDATA44 __attribute__((section("sfrs"), address(0xBF8EA8B0)));
typedef struct {
  uint32_t PIXEL117:4;
  uint32_t PIXEL116:4;
  uint32_t PIXEL115:4;
  uint32_t PIXEL114:4;
  uint32_t PIXEL113:4;
  uint32_t PIXEL112:4;
  uint32_t PIXEL111:4;
  uint32_t PIXEL110:4;
} __GLCDCURDATA44bits_t;
extern volatile __GLCDCURDATA44bits_t GLCDCURDATA44bits __asm__ ("GLCDCURDATA44") __attribute__((section("sfrs"), address(0xBF8EA8B0)));
#define GLCDCURDATA45 GLCDCURDATA45
extern volatile uint32_t   GLCDCURDATA45 __attribute__((section("sfrs"), address(0xBF8EA8B4)));
typedef struct {
  uint32_t PIXEL1115:4;
  uint32_t PIXEL1114:4;
  uint32_t PIXEL1113:4;
  uint32_t PIXEL1112:4;
  uint32_t PIXEL1111:4;
  uint32_t PIXEL1110:4;
  uint32_t PIXEL119:4;
  uint32_t PIXEL118:4;
} __GLCDCURDATA45bits_t;
extern volatile __GLCDCURDATA45bits_t GLCDCURDATA45bits __asm__ ("GLCDCURDATA45") __attribute__((section("sfrs"), address(0xBF8EA8B4)));
#define GLCDCURDATA46 GLCDCURDATA46
extern volatile uint32_t   GLCDCURDATA46 __attribute__((section("sfrs"), address(0xBF8EA8B8)));
typedef struct {
  uint32_t PIXEL1123:4;
  uint32_t PIXEL1122:4;
  uint32_t PIXEL1121:4;
  uint32_t PIXEL1120:4;
  uint32_t PIXEL1119:4;
  uint32_t PIXEL1118:4;
  uint32_t PIXEL1117:4;
  uint32_t PIXEL1116:4;
} __GLCDCURDATA46bits_t;
extern volatile __GLCDCURDATA46bits_t GLCDCURDATA46bits __asm__ ("GLCDCURDATA46") __attribute__((section("sfrs"), address(0xBF8EA8B8)));
#define GLCDCURDATA47 GLCDCURDATA47
extern volatile uint32_t   GLCDCURDATA47 __attribute__((section("sfrs"), address(0xBF8EA8BC)));
typedef struct {
  uint32_t PIXEL1131:4;
  uint32_t PIXEL1130:4;
  uint32_t PIXEL1129:4;
  uint32_t PIXEL1128:4;
  uint32_t PIXEL1127:4;
  uint32_t PIXEL1126:4;
  uint32_t PIXEL1125:4;
  uint32_t PIXEL1124:4;
} __GLCDCURDATA47bits_t;
extern volatile __GLCDCURDATA47bits_t GLCDCURDATA47bits __asm__ ("GLCDCURDATA47") __attribute__((section("sfrs"), address(0xBF8EA8BC)));
#define GLCDCURDATA48 GLCDCURDATA48
extern volatile uint32_t   GLCDCURDATA48 __attribute__((section("sfrs"), address(0xBF8EA8C0)));
typedef struct {
  uint32_t PIXEL127:4;
  uint32_t PIXEL126:4;
  uint32_t PIXEL125:4;
  uint32_t PIXEL124:4;
  uint32_t PIXEL123:4;
  uint32_t PIXEL122:4;
  uint32_t PIXEL121:4;
  uint32_t PIXEL120:4;
} __GLCDCURDATA48bits_t;
extern volatile __GLCDCURDATA48bits_t GLCDCURDATA48bits __asm__ ("GLCDCURDATA48") __attribute__((section("sfrs"), address(0xBF8EA8C0)));
#define GLCDCURDATA49 GLCDCURDATA49
extern volatile uint32_t   GLCDCURDATA49 __attribute__((section("sfrs"), address(0xBF8EA8C4)));
typedef struct {
  uint32_t PIXEL1215:4;
  uint32_t PIXEL1214:4;
  uint32_t PIXEL1213:4;
  uint32_t PIXEL1212:4;
  uint32_t PIXEL1211:4;
  uint32_t PIXEL1210:4;
  uint32_t PIXEL129:4;
  uint32_t PIXEL128:4;
} __GLCDCURDATA49bits_t;
extern volatile __GLCDCURDATA49bits_t GLCDCURDATA49bits __asm__ ("GLCDCURDATA49") __attribute__((section("sfrs"), address(0xBF8EA8C4)));
#define GLCDCURDATA50 GLCDCURDATA50
extern volatile uint32_t   GLCDCURDATA50 __attribute__((section("sfrs"), address(0xBF8EA8C8)));
typedef struct {
  uint32_t PIXEL1223:4;
  uint32_t PIXEL1222:4;
  uint32_t PIXEL1221:4;
  uint32_t PIXEL1220:4;
  uint32_t PIXEL1219:4;
  uint32_t PIXEL1218:4;
  uint32_t PIXEL1217:4;
  uint32_t PIXEL1216:4;
} __GLCDCURDATA50bits_t;
